module.exports = {
  title: "cdmetro-subway",
  width: 1644,
  height: 1177,
  lines: [
    {
      id: "line-1",
      name: "1号线",
      paths: [
        {
          id: "line-1-2",
          color: "#2b0071",
          d:
            "M365.039-144.2v364.86l.06,664.6a3.617,3.617,0,0,0,1.223,2.527c1.284,1.264,1.572.827,5,.827,59.109,0,629.28.17,678.8.17",
          x: 0.484,
          y: 0
        },
        {
          id: "line-1-1",
          color: "#2b0071",
          d: "M436.745,547.76V501.774a6.283,6.283,0,0,1,1.716-2.907,6.053,6.053,0,0,1,3.171-1.034H544.485",
          x: -45,
          y: 340.69
        }
      ],
      x: -54.309,
      y: -3
    },
    {
      id: "line-2",
      name: "2号线",
      d: "M-258.832-162.283h125.6L218.917,233.443h72.789L505.313,424.58H652.039L810.682,568.859H990.435",
      x: 36,
      y: -6,
      color: "#db613f"
    },
    {
      id: "line-3",
      name: "3号线",
      d: "M-341.154,727.09l189.032-186.241h181.7l164.4-184.584H309.449l119.075-143.64V6.435l300.2-261.1H846.691",
      color: "#f403aa"
    },
    {
      id: "line-10",
      name: "10号线",
      d: "M72.235,486.517-108.61,687.811",
      x: -31,
      y: 42,
      color: "#53539b"
    },
    {
      id: "line-7",
      name: "7号线",
      d:
        "M29.069,352.5l.082,162.447s-.084,2.313,1.019,3.354,3.807.9,3.807.9L635.2,520.689a4.52,4.52,0,0,0,2.558-.916,3.939,3.939,0,0,0,1.034-2.228L638.143,7.811a4.591,4.591,0,0,0-.9-2.5,3.5,3.5,0,0,0-2.275-.777L32.588-4.118a3.823,3.823,0,0,0-2.308.743,4.167,4.167,0,0,0-1.033,2.366l-.177,19.028V352.5Z",
      x: -3,
      y: 6,
      color: "#a3d5e6"
    },
    {
      id: "line-4",
      name: "4号线",
      d: "M-510.464,332.881-354.5,204.463l621.249-1.124h91.274L487.828,311.527l429.745.47",
      x: -10,
      y: -54,
      color: "#09b10f"
    }
  ],
  stations: [
    {
      name: "万盛",
      x: -476,
      y: 273,
      type: 1
    },
    {
      name: "杨柳河",
      x: -446,
      y: 249,
      type: 1
    },
    {
      name: "凤溪河",
      x: -413,
      y: 222,
      type: 1
    },
    {
      name: "南熏大道",
      x: -381,
      y: 196,
      type: 1
    },
    {
      name: "光华公园",
      x: -351,
      y: 171,
      type: 1
    },
    {
      name: "凤凰大街",
      x: -272,
      y: 145,
      type: 1
    },
    {
      name: "犀浦",
      x: -179,
      y: -173,
      type: 1
    },
    {
      name: "天河路",
      x: -127,
      y: -173,
      type: 1
    },
    {
      name: "迎宾大道",
      x: 12,
      y: -100,
      type: 1
    },
    {
      name: "金周路",
      x: -40,
      y: -159,
      type: 1
    },
    {
      name: "金科北路",
      x: -14,
      y: -130,
      type: 1
    },
    {
      name: "茶店子客运站",
      x: 41,
      y: -67,
      type: 1
    },
    {
      name: "羊犀立交",
      x: 68,
      y: -38,
      type: 1
    },
    {
      name: "茶店子",
      x: 144,
      y: -2,
      type: 1
    },
    {
      name: "蜀汉东路",
      x: 140,
      y: 44,
      type: 1
    },
    {
      name: "白果林",
      x: 183,
      y: 93,
      type: 1
    },
    {
      name: "花照壁",
      x: 186,
      y: -2,
      type: 1
    },
    {
      name: "九里提",
      x: 267,
      y: -1,
      type: 1
    },
    {
      name: "西南交大",
      x: 227,
      y: -2,
      type: 1
    },
    {
      name: "北站西二路",
      x: 307,
      y: -1,
      type: 1
    },
    {
      name: "升仙湖",
      x: 355,
      y: -75,
      type: 1
    },
    {
      name: "韦家碾",
      x: 355,
      y: -151,
      type: 1
    },
    {
      name: "金沙博物馆",
      x: 71,
      y: 67,
      type: 1
    },
    {
      name: "东坡路",
      x: 71,
      y: 230,
      type: 1
    },
    {
      name: "龙爪堰",
      x: 71,
      y: 315,
      type: 1
    },
    {
      name: "武侯大道",
      x: 71,
      y: 411,
      type: 1
    },
    {
      name: "川藏立交",
      x: 18,
      y: 537,
      type: 1
    },
    {
      name: "簇锦",
      x: 49,
      y: 563,
      type: 1
    },
    {
      name: "华兴",
      x: 18,
      y: 598,
      type: 1
    },
    {
      name: "双流机场1航站楼",
      x: -52,
      y: 676,
      type: 1
    },
    {
      name: "双流机场2航站楼",
      x: -92,
      y: 722,
      type: 1
    },
    {
      name: "金花",
      x: -14,
      y: 634,
      type: 1
    },
    {
      name: "武青南路",
      x: -117,
      y: 545,
      type: 1
    },
    {
      name: "双凤桥",
      x: -142,
      y: 569,
      type: 1
    },
    {
      name: "龙桥路",
      x: -164,
      y: 592,
      type: 1
    },
    {
      name: "迎春桥",
      x: -211,
      y: 637,
      type: 1
    },
    {
      name: "东升",
      x: -232,
      y: 658,
      type: 1
    },
    {
      name: "双流广场",
      x: -253,
      y: 679,
      type: 1
    },
    {
      name: "双流西站",
      x: -295,
      y: 722,
      type: 1
    },
    {
      name: "三里坝",
      x: -274,
      y: 701,
      type: 1
    },
    {
      name: "航都大街",
      x: -187,
      y: 614,
      type: 1
    },
    {
      name: "武侯立交",
      x: -53,
      y: 537,
      type: 1
    },
    {
      name: "神仙树",
      x: 266,
      y: 521,
      type: 1
    },
    {
      name: "倪家桥",
      x: 354,
      y: 405,
      type: 1
    },
    {
      name: "锦江宾馆",
      x: 355,
      y: 258,
      type: 1
    },
    {
      name: "人民北路",
      x: 355,
      y: 44,
      type: 1
    },
    {
      name: "文殊院",
      x: 355,
      y: 90,
      type: 1
    },
    {
      name: "华西坝",
      x: 355,
      y: 303,
      type: 1
    },
    {
      name: "高新",
      x: 355,
      y: 563,
      type: 1
    },
    {
      name: "桐梓林",
      x: 355,
      y: 464,
      type: 1
    },
    {
      name: "金融城",
      x: 355,
      y: 605,
      type: 1
    },
    {
      name: "孵化园",
      x: 355,
      y: 647,
      type: 1
    },
    {
      name: "锦城广场",
      x: 355,
      y: 689,
      type: 1
    },
    {
      name: "世纪城",
      x: 355,
      y: 731,
      type: 1
    },
    {
      name: "天府三街",
      x: 355,
      y: 773,
      type: 1
    },
    {
      name: "华府大道",
      x: 355,
      y: 857,
      type: 1
    },
    {
      name: "五根松",
      x: 490,
      y: 830,
      type: 1
    },
    {
      name: "广都",
      x: 422,
      y: 829,
      type: 1
    },
    {
      name: "广福",
      x: 561,
      y: 880,
      type: 1
    },
    {
      name: "天府公园",
      x: 799,
      y: 880,
      type: 1
    },
    {
      name: "兴隆湖",
      x: 978,
      y: 880,
      type: 1
    },
    {
      name: "华阳",
      x: 442,
      y: 880,
      type: 1
    },
    {
      name: "麓湖",
      x: 680,
      y: 880,
      type: 1
    },
    {
      name: "红石公园",
      x: 621,
      y: 880,
      type: 1
    },
    {
      name: "西博城",
      x: 859,
      y: 880,
      type: 1
    },
    {
      name: "科学城",
      x: 1038,
      y: 880,
      type: 1
    },
    {
      name: "海昌路",
      x: 502,
      y: 880,
      type: 1
    },
    {
      name: "武汉路",
      x: 740,
      y: 880,
      type: 1
    },
    {
      name: "广州路",
      x: 919,
      y: 880,
      type: 1
    },
    {
      name: "四河",
      x: 382,
      y: 880,
      type: 1
    },
    {
      name: "天府五街",
      x: 355,
      y: 815,
      type: 1
    },
    {
      name: "高朋大道",
      x: 190,
      y: 521,
      type: 1
    },
    {
      name: "三瓦窑",
      x: 434,
      y: 521,
      type: 1
    },
    {
      name: "琉璃场",
      x: 508,
      y: 521,
      type: 1
    },
    {
      name: "大观",
      x: 680,
      y: 476,
      type: 1
    },
    {
      name: "惠王陵",
      x: 766,
      y: 443,
      type: 1
    },
    {
      name: "成渝立交",
      x: 734,
      y: 415,
      type: 1
    },
    {
      name: "洪河",
      x: 795,
      y: 470,
      type: 1
    },
    {
      name: "成都行政学院",
      x: 827,
      y: 499,
      type: 1
    },
    {
      name: "大面铺",
      x: 858,
      y: 527,
      type: 1
    },
    {
      name: "连山坡",
      x: 889,
      y: 556,
      type: 1
    },
    {
      name: "界牌",
      x: 934,
      y: 557,
      type: 1
    },
    {
      name: "龙泉驿",
      x: 1070,
      y: 557,
      type: 1
    },
    {
      name: "龙平路",
      x: 1024,
      y: 557,
      type: 1
    },
    {
      name: "书房",
      x: 979,
      y: 557,
      type: 1
    },
    {
      name: "十陵",
      x: 795,
      y: 252,
      type: 1
    },
    {
      name: "成都大学",
      x: 847,
      y: 252,
      type: 1
    },
    {
      name: "明蜀王陵",
      x: 899,
      y: 252,
      type: 1
    },
    {
      name: "西河",
      x: 951,
      y: 252,
      type: 1
    },
    {
      name: "来龙",
      x: 743,
      y: 252,
      type: 1
    },
    {
      name: "迎晖路",
      x: 680,
      y: 331,
      type: 1
    },
    {
      name: "双店路",
      x: 680,
      y: 194,
      type: 1
    },
    {
      name: "崔家店",
      x: 680,
      y: 136,
      type: 1
    },
    {
      name: "理工大学",
      x: 680,
      y: 78,
      type: 1
    },
    {
      name: "府青路",
      x: 556,
      y: 3,
      type: 1
    },
    {
      name: "昭觉寺南路",
      x: 504,
      y: -26,
      type: 1
    },
    {
      name: "动物园",
      x: 532,
      y: -50,
      type: 1
    },
    {
      name: "熊猫大道",
      x: 561,
      y: -75,
      type: 1
    },
    {
      name: "军区总医院",
      x: 590,
      y: -100,
      type: 1
    },
    {
      name: "三河场",
      x: 684,
      y: -183,
      type: 1
    },
    {
      name: "锦水河",
      x: 711,
      y: -206,
      type: 1
    },
    {
      name: "团结新区",
      x: 740,
      y: -231,
      type: 1
    },
    {
      name: "马超西路",
      x: 767,
      y: -255,
      type: 1
    },
    {
      name: "钟楼",
      x: 808,
      y: -259,
      type: 1
    },
    {
      name: "成都医学院",
      x: 889,
      y: -259,
      type: 1
    },
    {
      name: "石油大学",
      x: 848,
      y: -259,
      type: 1
    },
    {
      name: "金华寺东路",
      x: 654,
      y: -157,
      type: 1
    },
    {
      name: "植物园",
      x: 621,
      y: -128,
      type: 1
    },
    {
      name: "八里庄",
      x: 620,
      y: 5,
      type: 1
    },
    {
      name: "二仙桥",
      x: 680,
      y: 20,
      type: 1
    },
    {
      name: "四川师大",
      x: 582,
      y: 521,
      type: 1
    },
    {
      name: "狮子山",
      x: 656,
      y: 521,
      type: 1
    },
    {
      name: "百草路",
      x: -75,
      y: -173,
      type: 1
    },
    {
      name: "马厂坝",
      x: -224,
      y: 145,
      type: 1
    },
    {
      name: "非遗博览园",
      x: -181,
      y: 145,
      type: 1
    },
    {
      name: "清江西路",
      x: 19,
      y: 145,
      type: 1
    },
    {
      name: "蔡桥",
      x: -128,
      y: 145,
      type: 1
    },
    {
      name: "中坝",
      x: -80,
      y: 145,
      type: 1
    },
    {
      name: "西南财大",
      x: 130,
      y: 145,
      type: 1
    },
    {
      name: "草堂北路",
      x: 183,
      y: 145,
      type: 1
    },
    {
      name: "宽窄巷子",
      x: 301,
      y: 145,
      type: 1
    },
    {
      name: "太升南路",
      x: 429,
      y: 174,
      type: 1
    },
    {
      name: "李家沱",
      x: 473,
      y: 50,
      type: 1
    },
    {
      name: "前锋路",
      x: 473,
      y: 99,
      type: 1
    },
    {
      name: "红星桥",
      x: 473,
      y: 151,
      type: 1
    },
    {
      name: "通惠门",
      x: 266,
      y: 186,
      type: 1
    },
    {
      name: "人民公园",
      x: 298,
      y: 221,
      type: 1
    },
    {
      name: "衣冠庙",
      x: 278,
      y: 350,
      type: 1
    },
    {
      name: "高升桥",
      x: 198,
      y: 395,
      type: 1
    },
    {
      name: "红牌楼",
      x: 142,
      y: 458,
      type: 1
    },
    {
      name: "东门大桥",
      x: 455,
      y: 297,
      type: 1
    },
    {
      name: "新南门",
      x: 399,
      y: 297,
      type: 1
    },
    {
      name: "磨子桥",
      x: 377,
      y: 325,
      type: 1
    },
    {
      name: "玉双路",
      x: 544,
      y: 252,
      type: 1
    },
    {
      name: "双桥路",
      x: 588,
      y: 252,
      type: 1
    },
    {
      name: "万年场",
      x: 632,
      y: 252,
      type: 1
    },
    {
      name: "牛王庙",
      x: 493,
      y: 331,
      type: 1
    },
    {
      name: "牛市口",
      x: 528,
      y: 362,
      type: 1
    },
    {
      name: "东大路",
      x: 565,
      y: 395,
      type: 1
    },
    {
      name: "塔子山公园",
      x: 626,
      y: 413,
      type: 1
    },
    {
      name: "涌泉",
      x: -320,
      y: 145,
      type: 1
    },
    {
      name: "成都西站",
      x: -30,
      y: 145,
      type: 1
    }
  ],
  texts: [
    {
      title: "火车北站",
      x: 329,
      y: 48,
      tspan: [
        {
          name: "火车北站",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "人民北路",
      x: 330,
      y: 108,
      tspan: [
        {
          name: "人民北路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "文殊院",
      x: 330,
      y: 153,
      tspan: [
        {
          name: "文殊院",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "骡马市",
      x: 330,
      y: 193,
      tspan: [
        {
          name: "骡马市",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "天府广场",
      x: 330,
      y: 267,
      tspan: [
        {
          name: "天府广场",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "锦江宾馆",
      x: 270,
      y: 320,
      tspan: [
        {
          name: "锦江宾馆",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "华西坝",
      x: 280,
      y: 365,
      tspan: [
        {
          name: "华西坝",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "省体育馆",
      x: 270,
      y: 426,
      tspan: [
        {
          name: "省体育馆",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "倪家桥",
      x: 280,
      y: 466,
      tspan: [
        {
          name: "倪家桥",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "桐梓林",
      x: 280,
      y: 527,
      tspan: [
        {
          name: "桐梓林",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "火车南站",
      x: 270,
      y: 567,
      tspan: [
        {
          name: "火车南站",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "高新",
      x: 290,
      y: 624,
      tspan: [
        {
          name: "高新",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "金融城",
      x: 280,
      y: 667,
      tspan: [
        {
          name: "金融城",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "锦城广场",
      x: 270,
      y: 752,
      tspan: [
        {
          name: "锦城广场",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "世纪城",
      x: 280,
      y: 793,
      tspan: [
        {
          name: "世纪城",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "天府三街",
      x: 270,
      y: 836,
      tspan: [
        {
          name: "天府三街",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "天府五街",
      x: 270,
      y: 878,
      tspan: [
        {
          name: "天府五街",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "华府大道",
      x: 270,
      y: 920,
      tspan: [
        {
          name: "华府大道",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "四河",
      x: 337,
      y: 957,
      tspan: [
        {
          name: "四河",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "华阳",
      x: 397,
      y: 957,
      tspan: [
        {
          name: "华阳",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "广都",
      x: 379,
      y: 876,
      tspan: [
        {
          name: "广都",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "五根松",
      x: 443,
      y: 876,
      tspan: [
        {
          name: "五根松",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "海昌路",
      x: 453,
      y: 926,
      tspan: [
        {
          name: "海昌路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "广福",
      x: 516,
      y: 957,
      tspan: [
        {
          name: "广福",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "红石公园",
      x: 567,
      y: 926,
      tspan: [
        {
          name: "红石公园",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "麓湖",
      x: 636,
      y: 957,
      tspan: [
        {
          name: "麓湖",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "武汉路",
      x: 690,
      y: 926,
      tspan: [
        {
          name: "武汉路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "天府公园",
      x: 746,
      y: 957,
      tspan: [
        {
          name: "天府公园",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "西博城",
      x: 810,
      y: 926,
      tspan: [
        {
          name: "西博城",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "广州路",
      x: 870,
      y: 957,
      tspan: [
        {
          name: "广州路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "兴隆湖",
      x: 928,
      y: 926,
      tspan: [
        {
          name: "兴隆湖",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "科学城",
      x: 986,
      y: 957,
      tspan: [
        {
          name: "科学城",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "孵化园",
      x: 280,
      y: 709,
      tspan: [
        {
          name: "孵化园",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "升仙湖",
      x: 330,
      y: -12,
      tspan: [
        {
          name: "升仙湖",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "韦家碾",
      x: 330,
      y: -89,
      tspan: [
        {
          name: "韦家碾",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "犀浦",
      x: -224,
      y: -125,
      tspan: [
        {
          name: "犀浦",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "天河路",
      x: -177,
      y: -97,
      tspan: [
        {
          name: "天河路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "百草路",
      x: -124,
      y: -125,
      tspan: [
        {
          name: "百草路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "金周路",
      x: -66,
      y: -97,
      tspan: [
        {
          name: "金周路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "金科北路",
      x: -40,
      y: -69,
      tspan: [
        {
          name: "金科北路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "迎宾大道",
      x: -14,
      y: -38,
      tspan: [
        {
          name: "迎宾大道",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "茶店子客运站",
      x: 16,
      y: -6,
      tspan: [
        {
          name: "茶店子客运站",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "羊犀立交",
      x: 43,
      y: 25,
      tspan: [
        {
          name: "羊犀立交",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "一品天下",
      x: 4,
      y: 50,
      tspan: [
        {
          name: "一品天下",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "蜀汉东路",
      x: 114,
      y: 106,
      tspan: [
        {
          name: "蜀汉东路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "白果林",
      x: 158,
      y: 155,
      tspan: [
        {
          name: "白果林",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "中医大\n省医院",
      x: 165,
      y: 224,
      tspan: [
        {
          name: "中医大",
          x: "0",
          y: "0"
        },
        {
          name: "省医院",
          x: "0",
          y: "12"
        }
      ]
    },
    {
      title: "通惠门",
      x: 240,
      y: 248,
      tspan: [
        {
          name: "通惠门",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "人民公园",
      x: 241,
      y: 299,
      tspan: [
        {
          name: "人民公园",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "春熙路",
      x: 404,
      y: 331,
      tspan: [
        {
          name: "春熙路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "东门大桥",
      x: 430,
      y: 358,
      tspan: [
        {
          name: "东门大桥",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "牛王庙",
      x: 468,
      y: 392,
      tspan: [
        {
          name: "牛王庙",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "牛市口",
      x: 504,
      y: 424,
      tspan: [
        {
          name: "牛市口",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "东大路",
      x: 539,
      y: 457,
      tspan: [
        {
          name: "东大路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "塔子山公园",
      x: 567,
      y: 492,
      tspan: [
        {
          name: "塔子山公园",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "成都\n东客站",
      x: 653,
      y: 452,
      tspan: [
        {
          name: "成都",
          x: "0",
          y: "0"
        },
        {
          name: "东客站",
          x: "0",
          y: "12"
        }
      ]
    },
    {
      title: "成渝立交",
      x: 707,
      y: 477,
      tspan: [
        {
          name: "成渝立交",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "惠王陵",
      x: 739,
      y: 505,
      tspan: [
        {
          name: "惠王陵",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "洪河",
      x: 769,
      y: 532,
      tspan: [
        {
          name: "洪河",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "成都行政学院",
      x: 800,
      y: 561,
      tspan: [
        {
          name: "成都行政学院",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "大面铺",
      x: 831,
      y: 589,
      tspan: [
        {
          name: "大面铺",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "连山坡",
      x: 813,
      y: 621,
      tspan: [
        {
          name: "连山坡",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "界牌",
      x: 887,
      y: 635,
      tspan: [
        {
          name: "界牌",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "书房",
      x: 933,
      y: 606,
      tspan: [
        {
          name: "书房",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "龙平路",
      x: 975,
      y: 635,
      tspan: [
        {
          name: "龙平路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "龙泉驿",
      x: 1017,
      y: 606,
      tspan: [
        {
          name: "龙泉驿",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "双流西站",
      x: -381,
      y: 782,
      tspan: [
        {
          name: "双流西站",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "三里坝",
      x: -351,
      y: 759,
      tspan: [
        {
          name: "三里坝",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "双流广场",
      x: -339,
      y: 736,
      tspan: [
        {
          name: "双流广场",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "东升",
      x: -300,
      y: 717,
      tspan: [
        {
          name: "东升",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "迎春桥",
      x: -288,
      y: 696,
      tspan: [
        {
          name: "迎春桥",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "航都大街",
      x: -274,
      y: 674,
      tspan: [
        {
          name: "航都大街",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "龙桥路",
      x: -242,
      y: 651,
      tspan: [
        {
          name: "龙桥路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "双凤桥",
      x: -219,
      y: 629,
      tspan: [
        {
          name: "双凤桥",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "武青南路",
      x: -204,
      y: 605,
      tspan: [
        {
          name: "武青南路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "武侯立交",
      x: -109,
      y: 613,
      tspan: [
        {
          name: "武侯立交",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "太平园",
      x: 58,
      y: 596,
      tspan: [
        {
          name: "太平园",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "高朋大道",
      x: 134,
      y: 571,
      tspan: [
        {
          name: "高朋大道",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "神仙树",
      x: 214,
      y: 597,
      tspan: [
        {
          name: "神仙树",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "三瓦窑",
      x: 382,
      y: 597,
      tspan: [
        {
          name: "三瓦窑",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "琉璃场",
      x: 458,
      y: 571,
      tspan: [
        {
          name: "琉璃场",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "四川师大",
      x: 527,
      y: 597,
      tspan: [
        {
          name: "四川师大",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "狮子山",
      x: 605,
      y: 571,
      tspan: [
        {
          name: "狮子山",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "大观",
      x: 654,
      y: 539,
      tspan: [
        {
          name: "大观",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "迎晖路",
      x: 654,
      y: 395,
      tspan: [
        {
          name: "迎晖路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "双店路",
      x: 654,
      y: 257,
      tspan: [
        {
          name: "双店路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "崔家店",
      x: 654,
      y: 198,
      tspan: [
        {
          name: "崔家店",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "理工大学",
      x: 654,
      y: 141,
      tspan: [
        {
          name: "理工大学",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "二仙桥",
      x: 654,
      y: 83,
      tspan: [
        {
          name: "二仙桥",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "八里庄",
      x: 569,
      y: 55,
      tspan: [
        {
          name: "八里庄",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "府青路",
      x: 505,
      y: 79,
      tspan: [
        {
          name: "府青路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "北站\n西二路",
      x: 271,
      y: 74,
      tspan: [
        {
          name: "北站",
          x: "-10",
          y: "0"
        },
        {
          name: "西二路",
          x: "-15",
          y: "12"
        }
      ]
    },
    {
      title: "西南交大",
      x: 170,
      y: 74,
      tspan: [
        {
          name: "西南交大",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "花照壁",
      x: 135,
      y: 50,
      tspan: [
        {
          name: "花照壁",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "茶店子",
      x: 93,
      y: 74,
      tspan: [
        {
          name: "茶店子",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "金沙博物馆",
      x: -23,
      y: 129,
      tspan: [
        {
          name: "金沙博物馆",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "东坡路",
      x: -3,
      y: 292,
      tspan: [
        {
          name: "东坡路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "龙爪堰",
      x: -3,
      y: 378,
      tspan: [
        {
          name: "龙爪堰",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "武侯大道",
      x: -13,
      y: 473,
      tspan: [
        {
          name: "武侯大道",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      x: 217,
      y: 50,
      tspan: [
        {
          name: "九里堤",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "高升桥",
      x: 121,
      y: 455,
      tspan: [
        {
          name: "高升桥",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "衣冠庙",
      x: 227,
      y: 399,
      tspan: [
        {
          name: "衣冠庙",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "磨子桥",
      x: 351,
      y: 391,
      tspan: [
        {
          name: "磨子桥",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "新南门",
      x: 371,
      y: 362,
      tspan: [
        {
          name: "新南门",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "市二医院",
      x: 453,
      y: 272,
      tspan: [
        {
          name: "市二医院",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "红星桥",
      x: 446,
      y: 214,
      tspan: [
        {
          name: "红星桥",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "前锋路",
      x: 446,
      y: 163,
      tspan: [
        {
          name: "前锋路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "李家沱",
      x: 444,
      y: 112,
      tspan: [
        {
          name: "李家沱",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "驷马桥",
      x: 400,
      y: 76,
      tspan: [
        {
          name: "驷马桥",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "昭觉寺南路",
      x: 477,
      y: 39,
      tspan: [
        {
          name: "昭觉寺南路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "熊猫大道",
      x: 533,
      y: -10,
      tspan: [
        {
          name: "熊猫大道",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "军区总医院",
      x: 562,
      y: -35,
      tspan: [
        {
          name: "军区总医院",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "植物园",
      x: 593,
      y: -63,
      tspan: [
        {
          name: "植物园",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "三河场",
      x: 657,
      y: -117,
      tspan: [
        {
          name: "三河场",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "锦水河",
      x: 684,
      y: -141,
      tspan: [
        {
          name: "锦水河",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "团结新区",
      x: 714,
      y: -166,
      tspan: [
        {
          name: "团结新区",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "钟楼",
      x: 762,
      y: -209,
      tspan: [
        {
          name: "钟楼",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "成都医学院",
      x: 832,
      y: -183,
      tspan: [
        {
          name: "成都医学院",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "石油大学",
      x: 794,
      y: -209,
      tspan: [
        {
          name: "石油大学",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "马超西路",
      x: 709,
      y: -209,
      tspan: [
        {
          name: "马超西路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "金华寺东路",
      x: 627,
      y: -91,
      tspan: [
        {
          name: "金华寺东路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "动物园",
      x: 504,
      y: 15,
      tspan: [
        {
          name: "动物园",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "红牌楼",
      x: 65,
      y: 517,
      tspan: [
        {
          name: "红牌楼",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "川藏立交",
      x: -35,
      y: 586,
      tspan: [
        {
          name: "川藏立交",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "万盛",
      x: -543,
      y: 336,
      tspan: [
        {
          name: "万盛",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "杨柳河",
      x: -471,
      y: 315,
      tspan: [
        {
          name: "杨柳河",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "凤溪河",
      x: -488,
      y: 283,
      tspan: [
        {
          name: "凤溪河",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "南熏大道",
      x: -408,
      y: 261,
      tspan: [
        {
          name: "南熏大道",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "光华公园",
      x: -436,
      y: 231,
      tspan: [
        {
          name: "光华公园",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "涌泉",
      x: -366,
      y: 195,
      tspan: [
        {
          name: "涌泉",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "马厂坝",
      x: -274,
      y: 195,
      tspan: [
        {
          name: "马厂坝",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "非遗博览园",
      x: -239,
      y: 221,
      tspan: [
        {
          name: "非遗博览园",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "蔡桥",
      x: -173,
      y: 195,
      tspan: [
        {
          name: "蔡桥",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "中坝",
      x: -126,
      y: 221,
      tspan: [
        {
          name: "中坝",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "成都西站",
      x: -84,
      y: 195,
      tspan: [
        {
          name: "成都西站",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "清江西路",
      x: -35,
      y: 221,
      tspan: [
        {
          name: "清江西路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "文化宫",
      x: 41,
      y: 195,
      tspan: [
        {
          name: "文化宫",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "西南财大",
      x: 77,
      y: 221,
      tspan: [
        {
          name: "西南财大",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "草堂北路",
      x: 130,
      y: 195,
      tspan: [
        {
          name: "草堂北路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "宽窄巷子",
      x: 247,
      y: 195,
      tspan: [
        {
          name: "宽窄巷子",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "太升南路",
      x: 388,
      y: 223,
      tspan: [
        {
          name: "太升南路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "玉双路",
      x: 494,
      y: 329,
      tspan: [
        {
          name: "玉双路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "双桥路",
      x: 538,
      y: 303,
      tspan: [
        {
          name: "双桥路",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "万年场",
      x: 581,
      y: 329,
      tspan: [
        {
          name: "万年场",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "槐树店",
      x: 652,
      y: 329,
      tspan: [
        {
          name: "槐树店",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "来龙",
      x: 698,
      y: 303,
      tspan: [
        {
          name: "来龙",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "十陵",
      x: 749,
      y: 329,
      tspan: [
        {
          name: "十陵",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "成都大学",
      x: 794,
      y: 303,
      tspan: [
        {
          name: "成都大学",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "明蜀王陵",
      x: 844,
      y: 329,
      tspan: [
        {
          name: "明蜀王陵",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "西河",
      x: 906,
      y: 303,
      tspan: [
        {
          name: "西河",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "凤凰大街",
      x: -329,
      y: 221,
      tspan: [
        {
          name: "凤凰大街",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "双流机场2航站楼",
      x: -116,
      y: 787,
      tspan: [
        {
          name: "双流机场2航站楼",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "双流机场1航站楼",
      x: -77,
      y: 741,
      tspan: [
        {
          name: "双流机场1航站楼",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "金花",
      x: -39,
      y: 699,
      tspan: [
        {
          name: "金花",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "华兴",
      x: -7,
      y: 662,
      tspan: [
        {
          name: "华兴",
          x: "0",
          y: "0"
        }
      ]
    },
    {
      title: "簇锦",
      x: 24,
      y: 628,
      tspan: [
        {
          name: "簇锦",
          x: "0",
          y: "0"
        }
      ]
    }
  ],
  "station-ex": [
    {
      name: "槐树店",
      x: 632,
      y: 305,
      width: "24",
      height: "12",
      type: 2
    },
    {
      name: "成都东客站",
      x: 632,
      y: 466,
      width: "24",
      height: "12",
      type: 2
    },
    {
      name: "一品天下",
      x: 49,
      y: 50,
      width: "24",
      height: "12",
      type: 2
    },
    {
      name: "火车北站",
      x: 309,
      y: 54,
      width: "24",
      height: "12",
      type: 2
    },
    {
      name: "驷马桥",
      x: 430,
      y: 54,
      width: "24",
      height: "12",
      type: 2
    },
    {
      name: "市二医院",
      x: 424,
      y: 262,
      width: "24",
      height: "12",
      type: 2
    },
    {
      name: "文化宫",
      x: 23,
      y: 198,
      width: "24",
      height: "12",
      type: 2
    },
    {
      name: "中医大省医院",
      x: 183,
      y: 198,
      width: "24",
      height: "12",
      type: 2
    },
    {
      name: "太平园",
      x: 40,
      y: 574,
      width: "24",
      height: "12",
      type: 2
    },
    {
      name: "火车南站",
      x: 308,
      y: 573,
      width: "24",
      height: "12",
      type: 2
    },
    {
      name: "省体育馆",
      x: 309,
      y: 402,
      width: "24",
      height: "12",
      type: 2
    },
    {
      name: "春熙路",
      x: 375,
      y: 322,
      width: "24",
      height: "12",
      type: 2
    },
    {
      name: "天府广场",
      x: 308,
      y: 274,
      width: "24",
      height: "12",
      type: 2
    },
    {
      name: "骡马市",
      x: 308,
      y: 197,
      width: "24",
      height: "12",
      type: 2
    }
  ]
};
